package test

import (
	"fmt"
	"strings"
	"testing"

	"github.com/tmck-code/go-ansi-convert/src/convert"
)

func TestFlipVertical(t *testing.T) {
	testCases := []struct {
		name     string
		input    []string
		expected []string
	}{
		{
			name: "ASCII lowercase vertical flip",
			input: []string{
				"abcdefghijklmnopqrstuvwxyz",
			},
			expected: []string{
				"ɐqɔpǝɟƃɥᴉɾʞlɯuodbɹsʇnʌʍxʎz",
			},
		},
		{
			name: "ASCII uppercase vertical flip",
			input: []string{
				"ABCDEFGHIJKLMNOPQRSTUVWXYZ",
			},
			expected: []string{
				"∀BↃDƎℲ⅁HIſ⋊⅂WᴎOԀΌᴚS⊥∩ᴧMX⅄Z",
			},
		},
		{
			// "█▀▀▀▐▄▐█"
			// "█▄▄▄▐▄▐█"
			name: "Unicode vertical flip",
			input: []string{
				"█▀▀▀▐▄▐█",
			},
			expected: []string{
				"█▄▄▄▐▀▐█",
			},
		},
		{
			name: "Unicode vertical flip 2",
			input: []string{
				"▁🭻🭺🭹🭸🭷🭶▔|🬞🬏▗▖▝▘🯤▘",
			},
			expected: []string{
				"▔🭶🭷🭸🭹🭺🭻▁|🬁🬀▝▘▗▖🯥▖",
			},
		},
		{
			name: "Unicode multi-line vertical flip",
			input: []string{
				"█████████████████▌▀▀█████",
				"██████▀██████▀ ▀▀▐▄ ▐████",
				"████▌▀▀▐█▌▄▌ ░▓▓ ▓▓▓ ████",
				"██▌▀▀▀▀▀▀▌█▌ ▐ ▀▄▓▐▄▀▀███",
			},
			expected: []string{
				"██▌▄▄▄▄▄▄▌█▌ ▐ ▄▀▓▐▀▄▄███",
				"████▌▄▄▐█▌▀▌ ░▓▓ ▓▓▓ ████",
				"██████▄██████▄ ▄▄▐▀ ▐████",
				"█████████████████▌▄▄█████",
			},
		},
		{
			name: "Text box vertical flip",
			input: []string{
				"┌───────────────────┐",
				"│  ╔═══╗ Some Text  │▒",
				"│  ╚═╦═╝ in the box │▒",
				"╞═╤══╩══╤═══════════╡▒",
				"│ ├──┬──┤           │▒",
				"│ └──┴──┘           │▒",
				"└───────────────────┘▒",
				"▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒",
			},
			expected: []string{
				"▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒",
				"┌───────────────────┐▒",
				"│ ┌──┬──┐           │▒",
				"│ ├──┴──┤           │▒",
				"╞═╧══╦══╧═══════════╡▒",
				"│  ╔═╩═╗ ᴉu ʇɥǝ qox │▒",
				"│  ╚═══╝ Soɯǝ ⊥ǝxʇ  │▒",
				"└───────────────────┘",
			},
		},
		{
			name: "LDA-FALL art vertical flip",
			input: []string{
				"    ■▄▓▄   ▄▌    ▄   ▄▄■█▀▀▄░░▄ ███■▀██░ █▓",
				"      ▀██▓▐▓▄▌   ▐░ ■▓██■▄▄■■▀▀░░▄▄███░░  █▀■",
				"     ■▀▀▄▒▀▀▀▄▄▄ ▀▒▌▄▄ ▀▀ ▄▀░▀▄■▄▄██▀░▐▌   ▌",
				"      ▄░░▀▌   ▄■▀▀▀▄▄█■▄  ▀▀▄█▀██▀▀▄▒▒█■██▄",
				"                    ▄▄▀▀▀▀▀▄▄██▀▀■▐▓▓▄██ ▀▀■",
				"          ▄▌▄■    ▀▀ ▄██■ ▄█▄█▀██▄▀▀  ▐▌▀▄",
				"     ▄■   ▐█▌▄■▄▄    ▀▓▀ █ ░█▐▓▓▄▄     █▄▌██▄▄",
				"    ▒▓▀■▄ ▄ █▄██▀▄        ██▌▀█▄▄▄■     ▀▄▐▀▓",
				"  ■▄▀██▄▌▓▄▌■▀█▐█▌ ■▄▄▄▄████▓ ▄░■        ▐▌",
				"    ▄▀▄█▄██▄░ ▐█▄▄██▀▀▀  ▐█▌░▓░▀▄▄      ▄█▌",
				"     ▓█▀▀▀█▒▀██▀▀       ▄██ ▐▌▀█▀▀▀_   ▐█▌",
				"    ▐▀▐▌█▄■ ■▀         ▐█,▌ ▐▀█▄▄▄▀     ■",
				"    ▬■▀         ▄ ▄    ▐█▐█▌▐░░▀■▀▓▓▓▄",
				"            ▌▄ ▐██▓░▄  █▌█■▀▄▄■▀■   ▀▀■",
				"    ■██▄  ▄■░░█▀█▀▀█▌▄█▀ ▐▌▓█  ▄██▄",
				"     ▄ ▀▄█░▐▓▀█▀▄░ ▄█▀    ■█▐▌█▀▀",
				"    ■▄▄█▓▀▄▄▄█▀▄▄█▄░▌░▄▄     ▐",
				"    _▄█▄■█▀■▀███▀▐▐▓█ ▀▓░    ▀▓",
				"   ■▀ ▀▀░  ▐█▄■▄▄█ ▀▐▌         ▌",
				"               ▄█▌▄▌▐▓",
				"          ▄▄▄█▀▀  ▀▓▄█",
				"        ▄▀▀ ■▀    ▄▀ █▀■▄■",
				"       ▀         ▐   ▐▄",
				"                       ■",
			},
			expected: []string{
				"                       ■",
				"       ▄         ▐   ▐▀",
				"        ▀▄▄ ■▄    ▀▄ █▄■▀■",
				"          ▀▀▀█▄▄  ▄▓▀█",
				"               ▀█▌▀▌▐▓",
				"   ■▄ ▄▄░  ▐█▀■▀▀█ ▄▐▌         ▌",
				"    ‾▀█▀■█▄■▄███▄▐▐▓█ ▄▓░    ▄▓",
				"    ■▀▀█▓▄▀▀▀█▄▀▀█▀░▌░▀▀     ▐",
				"     ▀ ▄▀█░▐▓▄█▄▀░ ▀█▄    ■█▐▌█▄▄",
				"    ■██▀  ▀■░░█▄█▄▄█▌▀█▄ ▐▌▓█  ▀██▀",
				"            ▌▀ ▐██▓░▀  █▌█■▄▀▀■▄■   ▄▄■",
				"    ▬■▄         ▀ ▀    ▐█▐█▌▐░░▄■▄▓▓▓▀",
				"    ▐▄▐▌█▀■ ■▄         ▐█'▌ ▐▄█▀▀▀▄     ■",
				"     ▓█▄▄▄█▒▄██▄▄       ▀██ ▐▌▄█▄▄▄‾   ▐█▌",
				"    ▀▄▀█▀██▀░ ▐█▀▀██▄▄▄  ▐█▌░▓░▄▀▀      ▀█▌",
				"  ■▀▄██▀▌▓▀▌■▄█▐█▌ ■▀▀▀▀████▓ ▀░■        ▐▌",
				"    ▒▓▄■▀ ▀ █▀██▄▀        ██▌▄█▀▀▀■     ▄▀▐▄▓",
				"     ▀■   ▐█▌▀■▀▀    ▄▓▄ █ ░█▐▓▓▀▀     █▀▌██▀▀",
				"          ▀▌▀■    ▄▄ ▀██■ ▀█▀█▄██▀▄▄  ▐▌▄▀",
				"                    ▀▀▄▄▄▄▄▀▀██▄▄■▐▓▓▀██ ▄▄■",
				"      ▀░░▄▌   ▀■▄▄▄▀▀█■▀  ▄▄▀█▄██▄▄▀▒▒█■██▀",
				"     ■▄▄▀▒▄▄▄▀▀▀ ▄▒▌▀▀ ▄▄ ▀▄░▄▀■▀▀██▄░▐▌   ▌",
				"      ▄██▓▐▓▀▌   ▐░ ■▓██■▀▀■■▄▄░░▀▀███░░  █▄■",
				"    ■▀▓▀   ▀▌    ▀   ▀▀■█▄▄▀░░▀ ███■▄██░ █▓",
			},
		},
	}
	for _, tc := range testCases {
		t.Run(tc.name, func(t *testing.T) {
			strInput := strings.Join(tc.input, "\n")
			input := convert.TokeniseANSIString(strInput)

			result := convert.FlipVertical(input)
			expected := [][]convert.ANSILineToken{}

			for _, line := range tc.expected {
				expected = append(expected, []convert.ANSILineToken{{FG: "", BG: "", T: line}})
			}

			PrintANSITestResults(strInput, expected, result, t)
			Assert(expected, result, t)
		})
	}
}
func TestVerticalMap(t *testing.T) {
	// Check that character exists in the vertical mirror map
	t.Run("check mapping is complete", func(t *testing.T) {
		var missing []unicodeChar
		var found []rune

		for _, r := range CompleteSet {
			if _, exists := convert.VerticalMirrorMap[r.char]; exists {
				found = append(found, r.char)
			} else {
				missing = append(missing, r)
			}
		}

		// for batch := range slices.Chunk(missing, 4) {
		// 	for _, ch := range batch {
		// 		fmt.Printf("U+%X '%c', ", ch.code, ch.char)
		// 	}
		// 	fmt.Println()
		// }

		completeSetStrings := []string{}
		for _, ch := range CompleteSet {
			completeSetStrings = append(completeSetStrings, fmt.Sprintf("U+%X '%c'", ch.code, ch.char))
		}
		completeMissingStrings := []string{}
		for _, ch := range missing {
			completeMissingStrings = append(completeMissingStrings, fmt.Sprintf("U+%X '%c'", ch.code, ch.char))
		}
		completeFoundStrings := []string{}
		for _, ch := range found {
			completeFoundStrings = append(completeFoundStrings, fmt.Sprintf("U+%X '%c'", ch, ch))
		}

		// PrintSimpleTestResults(
		// 	strings.Join(completeSetStrings, ", "),
		// 	"",
		// 	strings.Join(completeMissingStrings, ", "),
		// )
		// Assert(len(missing), len(CompleteSet), t)
		// Assert(len(missing), 0, t)
	})
}
